{"title":"关于：边界","date":"2020-03-29T15:48:28.000Z","link":"post/define-boundary","updated":"2020-03-30T01:29:34.159Z","content":"<blockquote>\n<p>写在前面的话：这篇blog已经拖延半年了，我深感如果还不动笔的话，内心的熵会不断增加，秩序和安宁会难以维持。So，It’s time.</p>\n</blockquote>\n<hr>\n<h2 id=\"什么是边界\">什么是边界<a href=\"post/define-boundary#什么是边界\"></a></h2><p>如何定义边界？抬头看一下周围的环境，其实边界无处不在。如果此时我们正在一间公寓里，比如说公寓房间的门就是一种边界：门内是属于我们的世界，有着属于我们的事物，电视，沙发，灯光，冰箱里的旺仔牛奶等等（这些事物又各自有着它们的边界）。我们在门内的世界定义自己的规则（如何时打扫，清洁等），给自己一个舒适的空间。门外的世界属于一个更大的群体，在那个世界里，又有它的规则，只有认识和遵守这些规则，才能和门外的世界更和睦地相处。所以看看，单单“房间的门”这么简单的边界，就可以让我们获得一些秩序和规则。</p>\n<p>地球，南北半球，国家的版图，切割省与省之间的山脉河流，城市，乡镇，长大的渔村。<strong>物理的边界</strong>几乎无处不在。更难定义的是虚拟的边界，或者说<strong>逻辑的边界</strong>。我们从小到大上过的学堂，小学，中学，大学。每个阶段又把“知识”分类成更小的学科，比如语文，数学，英语，历史，物理等等。而在虚拟的边界里，最难定义是人心的边界：什么是善，什么是恶；什么是忠，什么是奸；什么是对，什么是错。</p>\n<p>如果盘古开天辟地，那他真的很了不起。<strong>在混沌中划分了第一道边界，从此天地明朗，万物可爱</strong>。</p>\n<hr>\n<h2 id=\"为什么要有边界\">为什么要有边界<a href=\"post/define-boundary#为什么要有边界\"></a></h2><p>回答这个问题，让我们用反向思维，想想如果没有边界的世界的样子。</p>\n<p>在地球这个框架下，一个国家，一套标准，一种信仰，不分边界和彼此。<br>我们的房间将将成为大家的房间，大家的房间也会成为我们的房间。<br>所有人都拥有“自由”，“世界大同”，一开始听起来很棒，不是吗？</p>\n<p>然后随之带来的问题是，当我们想要一个独立的空间的想法。而在边界缺失的体系里，这些声音统统会被“大同世界”掩盖和吞没。如果是这样，那么没有边界的“大同世界”，跟充满混沌的世界有什么区别呢？</p>\n<p>从自由的角度出发，如果每个人都拥有绝对的自由，相当于没有人拥有自由；<br>杀戮和纷争会代替规则，没有人能各行其道，这会是场没有尽头的零和博弈。</p>\n<p>概念是不是太抽象了？嗯让我们从生活入手，具体化一点。</p>\n<p>长辈们会用“都是为你了好”这个理由来替我们作决定。<br>善意会被当作理所当然，“升米恩，斗米仇”的剧情开始上演。<br>感受会被忽略和欺骗，最后甚至不敢面对真实感受。<br>一锅乱炖的食材，料酒和花雕酒不会有区别。<br>四季变得不分明，你在南方的艳阳里，穿加拿大鹅。<br>… …</p>\n<p>从我们最关心的人与人的关系的角度出发，如果缺乏边界，善意就会变的廉价，人与人之间会开始缺失尊重，相处变得不舒服，误解和怨恨被滋养；独立的自我被压抑和掩盖 — “梦醒时分，甚至开始怀疑人生”。</p>\n<p>那么有了边界的人与人之间的关系会是什么样的？</p>\n<p>田馥甄的《小幸运》里有一句歌词：“<strong>来不及感谢是你给我勇气，让我能做回我自己</strong>”。当Ta内心的边界被入侵的时候，帮助Ta学会拒绝；当Ta踏出舒适圈感到恐惧的时候，帮助Ta拥有勇气; 当Ta无所适从充满疑虑的时候，帮助Ta找到安宁。所有的本质，其实都是帮助对方建立和确认边界，让双方可以成为更加独立的个体，棱角分明，边界清晰，从而更加舒服和人，和世界相处。</p>\n<p><img src=\"images/2020/2020.03.29.jpg\" alt=\"boundary\" class=\"article-img\"></p>\n<hr>\n<h2 id=\"如何做到有边界\">如何做到有边界<a href=\"post/define-boundary#如何做到有边界\"></a></h2><p>继续反向思维，我们很难做到边界分明的原因有哪些呢？</p>\n<p>可能是不让对方失望，迎合对方的期待，就是我们今天常说的人设；可能是从小长大的环境和教育告诉我们什么事对错，什么是该做不该做的；也可能是内心的不安所以需要不断确认和证明自己存在的价值等等。</p>\n<p>所有的本质都是不自由。</p>\n<p>那如何做到自由呢？方法很简单，那就是<strong>诚实面对内心的感受</strong>。一些事情，这么做让我们内心感到舒服和安宁，那就这么做好了，尤其是在根本就没有明确对错的前提下。</p>\n<p>当然，前面也说过，绝对的自由相当于没有自由，所以我们这里说的自由，是相对自由。</p>\n<p>什么是相对自由？也很简单，就是有前提条件下的自由。这个前提条件应该是像法律这种对权力非常明确规则。</p>\n<p>法律的本质是权力。<strong>只要是不伤害别人的事，那就是你的自由。如果有伤害别人的可能，权力就可以介入</strong>。</p>\n<p>最后我们也常常在问，某些事，是我们的自由，也是我们的权力。让我们仍然因为道德，舆论，或者担心给他人造成的影响而犹豫不决。比如说拒绝他人，这是我们的自由和权力，有时候我们却会因没有帮助到他人而内疚。</p>\n<p>这个时候我们就需要用到“<strong>课题分离</strong>”这个概念了。问两个问题： <strong>这件事对谁的影响最大？最终责任应该由谁来承担？</strong> 如果答案都不是自己，那就可以完全不感到内疚和抱歉。他人的事情，理论上我们爱莫能助。认识到自己的力所能及（或者说能力边界），以及给他人独立处理个人事务的机会，这不一定会让自己和他人变得更好，但至少没有让情况变得更糟。</p>\n<p>所以，<strong>边界的三道过滤网：自由，权力，课题</strong>。</p>\n<p>自由：诚实面对感受<br>权力：对自由的约束<br>课题：认清影响和责任</p>\n<hr>\n<h2 id=\"有些边界\">有些边界<a href=\"post/define-boundary#有些边界\"></a></h2><h4 id=\"宽容和懦弱\">宽容和懦弱<a href=\"post/define-boundary#宽容和懦弱\"></a></h4><p>边界：当我们宽容的时候，我们心里充满的是怜悯和同情；当我们懦弱的时候，我们心里充满的是愤怒和屈辱。</p>\n<h4 id=\"尊重，鼓励和迎合\">尊重，鼓励和迎合<a href=\"post/define-boundary#尊重，鼓励和迎合\"></a></h4><p>边界：是否委屈内心。</p>\n<hr>\n<p>拥有清晰边界的人，往往也是能更好善待自己，他人和世界的人。<br><strong>事物的边界跟随时代，环境，立场而不断变化</strong>；天地之间有杆秤，平衡是一种动态的边界。<br>接受曾经无法接受的，想象曾经无法想象的，成长如是。</p>\n","prev":{"title":"随想：光波","link":"post/wave-particle-duality"},"next":{"title":"随想：我去2020年","link":"post/going-to-2020"},"plink":"http://poundkey.github.io/post/define-boundary/","toc":[{"title":"什么是边界","id":"什么是边界","index":"1"},{"title":"为什么要有边界","id":"为什么要有边界","index":"2"},{"title":"如何做到有边界","id":"如何做到有边界","index":"3"},{"title":"有些边界","id":"有些边界","index":"4"}]}