{"title":"随想：光波","date":"2020-04-18T06:54:30.000Z","link":"post/wave-particle-duality","tags":["life","thoughts"],"updated":"2020-04-18T06:49:41.932Z","content":"<p>“Biu Biu Biu, 动感光波，我要开始清扫啦～”</p>\n<p>传来Roborock扫地机器人开始定时清扫的声音，给它调了蜡笔小新的配音。</p>\n<p>突然发现我其实并不了解光和波是什么。</p>\n<hr>\n<p>什么是光？</p>\n<p>光是由光子组成的。</p>\n<p>那么又是光子呢？</p>\n<p>光子是一种基本粒子？</p>\n<p>那什么是基本粒子？</p>\n<p>基本粒子的定义随着时代变化，简单来说就是搭建一套系统的最小单位，我们可以对比拼Lego用的block。古希腊时的哲学家就提出了以“原子”为基本粒子。20世纪前、中期的基本粒子是指质子、中子、电子、光子和各种介子，这是当时人类所能探测的最小粒子。后来又引入了的了费米子和波色子：夸克和轻子是费米子，之前提到的光子是玻色子的一种。</p>\n<p>为什么需要基本粒子？</p>\n<p>举个栗子，音律系统里的音高，“C D  E F G A B”，或者说我们更熟悉的唱名“do re mi fa sol la si”, 本质上是从一个基础的声音频率出发，每个音高之间按比例分配频率（e.g., 十二平均律里 D = 12√2 C)，加上和时间的排列组合，形成直达人心的动人旋律。</p>\n<p>物理世界也是相同的道理，比如说基本粒子夸克的定义是“裸质量约为1.8–3.0 MeV/c2， 自旋为1⁄2，带有电荷+2⁄3 e”，而音高中 Middle C 音高大约是261.63 Hz，把基本粒子比喻成“频率不同而又相互和谐的音阶”，它们的排列组合，奏响物理世界美丽的乐章，这样可以有助于理解吗？</p>\n<p>我隐约听到过一个概念，“波粒二象性”，这很confusing啊。</p>\n<p>是的，得确很confusing，其实我们可以想想，基础粒子到底表示的是什么呢？相比于物理概念，我觉得它更像一个逻辑概念。比如上面我们提到过的上夸克，定义是有某些数量的质量，自旋和电荷。聪明的你再想想看，质量，电荷，自旋，这些对应的概念像不像势能，热能，动能等…</p>\n<p>是啊！这不就是描述能量吗！</p>\n<p>是的，也许基本的粒子就是对很小单位的能量进行分类。独具匠心的物理学家们首先完成了用粒子的模型来表示能量的“矩阵力学”来描述微观世界里物质是如何运动的。既然能量能用粒子来建模，那么上个世纪初的那些打开量子力学世界的物理巧匠们，也提出了用波的模型来表示能量。其中这些的名字最闪眼的一定薛定鄂啦，他是“波动力学”的创始人，怎么说呢，薛定谔方程在量子力学中的地位，大致相当牛顿三大定律在经典力学中的地位。</p>\n<p>生活中的波其实无处不在，小如拨动一下琴弦和WiFi连接的信号，大如白胡子老爹地震果实产生的能量，都可以用波来表示呢，这个… … 真的很了不起呢。</p>\n<p>后来又有一名巧匠，当当当当，就是上天入地无所不能的冯诺伊曼，从数学上证明了矩阵力学和波动力学其实是等价的。怎么证明我们就不深究了，听说呢，他还顺便证明了量子力学有无数描述方式。</p>\n<p>这就是波粒二象性的简单解释了。殊途同归，isn’t?</p>\n<p>嗯，我想… 这世上很多事物会不会都指向了一个相同的起点呢… …？</p>\n<p>啊，会不会，不管是波还是光，以及在这之上延伸出的各种物理概念，其实都是在描述能量是如何转换的呢？<br>等等！会不会…. 我有个大胆的想法，会不会人类文明史上的几乎所有学科和模型，都是在描述“能量转换”这个永恒的主题呢？不管是物理，化学，生物，经济学，信息学，医学，脑神经科学，甚至心理学等等等等（OS: 只有数学… 好像是个例外，感觉数学更像是纯粹的逻辑产物，完全就是无中生有，并不是用来描述某个有实体东西）。</p>\n<p>哈哈哈哈，这个想法真的很有趣呢！你还记得高中学过的“能量守恒定律”吗？</p>\n<p>模模糊糊记得，比如说势能和动能是是可以相互转换的，永动机貌似是无法实现的。</p>\n<p>哈哈，看来学的东西还没有完全还给老师呢。是的，能量守恒定律说的就是在一个孤立系统中，总的能量E保持不变。能量不能无故生成，也不能无故摧毁，但它能够改变形式。</p>\n<p>我知道你又要问至于什么是“孤立系统”啦。除了整个宇宙，孤立系统并不存在于现实之中。可被近似于孤立系统的模型包括太阳系内的太阳以及行星，氢原子内的质子以及电子等。</p>\n<p>难怪古人说每个尘埃都是一个宇宙呢，一定是从“能量守恒”的角度出发的吧。</p>\n<p>等等… … 既然能量守恒，能量不会被无故的产生和消失，那么宇宙最开始的能量是从哪里来的呢？</p>\n<p>哈哈哈哈哈哈，这真是一个很有意思的问题呢？上帝会不会真的存在呢？还是只是一声莫名的Big Bang？<br>从虚空出产生，亦或许这个世界，其实就是数学的世界？哈哈哈哈哈… …</p>\n<hr>\n<p>我们改天再聊吧，夜已深，希望有吉他和美丽动人的音乐陪你睡～</p>\n<p>晚安，世界。</p>\n","next":{"title":"关于：边界","link":"post/define-boundary"},"plink":"http://poundkey.github.io/post/wave-particle-duality/"}